vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
	ret = bl_mtd_open(BL_MTD_PARTITION_NAME_FW_DEFAULT, &handle, BL_MTD_OPEN_FLAG_BACKUP);
	if(ret)
	{
		// return http_rest_error(request, -20, "Open Default FW partition failed");
        puts("Open Default FW partition failed\r\n");
        return 1;
	}

	recv_buffer = pvPortMalloc(OTA_PROGRAM_SIZE);

	unsigned int buffer_offset, flash_offset, ota_addr;
	uint32_t bin_size;
	uint8_t activeID;
	HALPartition_Entry_Config ptEntry;

	activeID = hal_boot2_get_active_partition();

	// printf("Starting OTA test. OTA bin addr is %p, incoming len %i\r\n", recv_buffer, writelen);

	// printf("[OTA] [TEST] activeID is %u\r\n", activeID);

	if(hal_boot2_get_active_entries(BOOT2_PARTITION_TYPE_FW, &ptEntry))
	{
		vPortFree(recv_buffer);
		bl_mtd_close(handle);
		// return http_rest_error(request, -20, "PtTable_Get_Active_Entries fail");
        puts("PtTable_Get_Active_Entries fail\r\n");
        return 1;
	}
	ota_addr = ptEntry.Address[!ptEntry.activeIndex];
	bin_size = ptEntry.maxLen[!ptEntry.activeIndex];

	// part_size = ptEntry.maxLen[!ptEntry.activeIndex];
	// (void)part_size;
	/*XXX if you use bin_size is product env, you may want to set bin_size to the actual
	 * OTA BIN size, and also you need to splilt XIP_SFlash_Erase_With_Lock into
	 * serveral pieces. Partition size vs bin_size check is also needed
	 */

	// printf("Starting OTA test. OTA size is %lu\r\n", bin_size);

    if(content_length >= bin_size)
    {
        puts("BIN file is too big");
        return 1;
        // return http_rest_error(request, -20, "Too large bin");
    }

	// printf("[OTA] [TEST] activeIndex is %u, use OTA address=%08x\r\n", ptEntry.activeIndex, (unsigned int)ota_addr);

	printf("[OTA] Erasing flash (%lu)...\r\n", bin_size);
	hal_update_mfg_ptable();

	// Erase in chunks, because erasing everything at once is slow and causes issues with http connection
    // ERASING
	uint32_t erase_offset = 0;
	uint32_t erase_len = 0;
	while(erase_offset < bin_size)
	{
		erase_len = bin_size - erase_offset;
		if(erase_len > 0x10000)
		{
			erase_len = 0x10000; //Erase in 64kb chunks
		}
		bl_mtd_erase(handle, erase_offset, erase_len);
		// printf("[OTA] Erased:  %lu / %lu \r\n", erase_offset, erase_len);
		erase_offset += erase_len;
		// rtos_delay_milliseconds(100);
	}
	printf("[OTA] Flash erased\r\n");
    // === ERASING ===


    // TODO: Edit write logic code
    // If more data is expected, read it into a buffer
    // grab data from http post request and write it to flash
    
    
    
	printf("[OTA] Flashing new firmware\r\n");
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;
    int remaining = content_length;
    // char *data_start;
    char *data_end;
    bool first = true;
    flash_offset = 0;
    while (remaining > 0) {
        // char chunk[MAX_BUFFER_SIZE];
        // int to_read = remaining > MAX_BUFFER_SIZE ? MAX_BUFFER_SIZE : remaining;
        err_t recv_err = netconn_recv(conn, &inbuf);
        if (recv_err == ERR_OK) {
            netbuf_data(inbuf, (void **)&buf, &buflen);
            // memcpy(post_data + body_length, buf, buflen);
            // body_length += buflen;
            // printf("Buflen: %d\r\n", buflen);
            remaining -= buflen;
            // data transmission
            if (first) {
                char *before = buf;
                buf = strstr(buf, "\r\n\r\n");
                buf += 4; // Skip past "\r\n\r\n"
                first = false;
                buflen -= (buf - before);
                printf("[OTA] Found data start, skipping %td bytes\r\n", buf - before);
            }
            data_end = strstr(buf, "\r\n------");
            if(data_end != NULL) {
                buflen = (data_end - buf);
                printf("[OTA] Found data end, last frame total bytes are %td\r\n", data_end - buf);
            }
            bl_mtd_write(handle, flash_offset, buflen, (u_int8_t*)buf);
            flash_offset += buflen;
            total += buflen;
            // printf("Flash takes %i\r\n", buflen);
            // printf("remaining %i\r\n", remaining);
            // printf("total %i\r\n", total);
            netbuf_delete(inbuf);
        } else {
            puts("Error receiving additional data\n");
            // free(post_data);
            netbuf_delete(inbuf);
            return ERR_CLSD;
        }
    }
	printf("[OTA] Flashed new firmware\r\n");
    // flash write logic
	// buffer_offset = 0;
	// flash_offset = 0;
	// do
	// {
	// 	char* useBuf = writebuf;
	// 	int useLen = writelen;


	// 	if(useLen)
	// 	{
			
	// 		//ADDLOG_DEBUG(LOG_FEATURE_OTA, "%d bytes to write", writelen);
	// 		//add_otadata((unsigned char*)writebuf, writelen);

	// 		printf("Flash takes %i. ", useLen);
	// 		bl_mtd_write(handle, flash_offset, useLen, (u_int8_t*)useBuf);
	// 		flash_offset += useLen;
	// 	}

	// 	total += writelen;
	// 	towrite -= writelen;

	// } while((towrite > 0) && (writelen >= 0));
    // ==== flash write logic ====
	printf("[OTA] set OTA partition length\r\n");
	ptEntry.len = total;
	// printf("[OTA] [TCP] Update PARTITION, partition len is %lu\r\n", ptEntry.len);
	hal_boot2_update_ptable(&ptEntry);
	puts("[OTA] Rebooting...\r\n");
    sys_msleep(500);
	vPortFree(recv_buffer);
	bl_mtd_close(handle);
    hal_reboot();
    return ERR_OK;
}

// err_t handle_firmware_upload(struct netconn *conn, char *request_buf, u16_t request_len) {
//     // http_rest_post_flash(request, -1, -1);

//     // Initialize OTA
//     // int ret = ota_init("ota_update");
//     // if (ret != 0) {
//     //     printf("[handle_firmware_upload] OTA initialization failed: %d\n", ret);
//     //     return ERR_VAL;
//     // }

//     // Extract the firmware binary from the HTTP POST body
//     // char *body = strstr(request_buf, "\r\n\r\n");
//     // if (!body) {
//     //     puts("[handle_firmware_upload] HTTP body not found\n");
//     //     // ota_deinit();
//     //     return ERR_VAL;
//     // }

//     // body += 4;  // Skip over "\r\n\r\n" to the start of the firmware binary
//     // u16_t body_len = request_len - (body - request_buf);
//     // printf("[handle_firmware_upload] Body length: %i\n", body_len);
//     // // Write the firmware to the OTA partition
//     // ret = ota_write(body, body_len);
//     // if (ret != 0) {
//     //     printf("[handle_firmware_upload] OTA write failed: %d\n", ret);
//     //     ota_deinit();
//     //     return ERR_VAL;
//     // }

//     // printf("[handle_firmware_upload] Firmware uploaded: %d bytes\n", body_len);

//     // // Finalize OTA
//     // ret = ota_finalize();
//     // if (ret != 0) {
//     //     printf("[handle_firmware_upload] OTA finalize failed: %d\n", ret);
//     //     ota_deinit();
//     //     return ERR_VAL;
//     // }

//     // printf("[handle_firmware_upload] Firmware upload successful\n");

