vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
//     // // Apply the new firmware and reboot
//     // ota_apply();
//     // bl_sys_reset();  // Reboot the device

//     return ERR_OK;
// }

#define MAX_BUFFER_SIZE 1024

// 0   1   3  4
// 20  21  3  4
const int pwm_to_pin[4][2] = {{0,20},{1,21},{3,3},{4,4}};
const int map[] = {0,1,2,3};

err_t httpd_handler(struct netconn *conn) {
    struct netbuf *inbuf;
    char *buf;
    u16_t buflen;
    static int pin = 0;

    // Receive HTTP request
    if (netconn_recv(conn, &inbuf) == ERR_OK) {
        netbuf_data(inbuf, (void **)&buf, &buflen);
        
        printf("HTTP Length: %i\n", buflen);
        printf("HTTP Request: %s\n\n", buf);

        // Check if the request is a POST (for file upload)
        if (strncmp(buf, "POST ", 5) == 0) {
            puts("[httpd_handler] Handling POST request...\n");
            int content_length = 0;
            // Parse Content-Length header
            char *content_length_str = strstr(buf, "Content-Length:");
            if (content_length_str) {
                sscanf(content_length_str, "Content-Length: %d", &content_length);
                printf("Content-Length header found: %d\n", content_length);
            } else {
                puts("Content-Length header not found\n");
            }
            if(strncmp(buf, "POST /ota", 9) == 0) {
                netbuf_delete(inbuf);
                puts("[httpd_handler] Handling firmware upload...\n");
                // I KNOW I'M SENDING the firmware now
                // Parse and handle the firmware data
                if (http_rest_post_flash(conn, content_length) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process firmware upload.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Firmware uploaded successfully.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
            } else if (strncmp(buf, "POST /wifi", 10) == 0) {
                puts("[httpd_handler] Handling wifi settings request...\n");
                char* body = malloc(content_length + 1);
                char* body_start = strstr(buf, "\r\n\r\n");
                body_start += 4;
                char* body_end = buf + buflen;
                int total_length = body_end - body_start;
                printf("Total length: %i\r\n", total_length);
                memcpy(body, body_start, total_length);
                netbuf_delete(inbuf);
                if (netconn_recv(conn, &inbuf) == ERR_OK) {
                    puts("Got additional data\r\n");
                    netbuf_data(inbuf, (void **)&buf, &buflen);
                    printf("Additional data length: %i\r\n", buflen);
                    memcpy(body + total_length, buf, buflen);
                }
                body[content_length] = '\0';
                printf("Body: %s\r\n", body);
                if (http_rest_post_wifi(body) != ERR_OK) {
                    const char *error_response =
                        "HTTP/1.1 500 Internal Server Error\r\n"
                        "Connection: close\r\n\r\n"
                        "Failed to process new wifi settings.";
                    netconn_write(conn, error_response, strlen(error_response), NETCONN_COPY);
                } else {
                    const char *success_response =
                        "HTTP/1.1 200 OK\r\n"
                        "Connection: close\r\n\r\n"
                        "Changed wifi settings.";
                    netconn_write(conn, success_response, strlen(success_response), NETCONN_COPY);
                }
                netbuf_delete(inbuf);
                free(body);
            }
            else if (strncmp(buf, "POST /pwm_start", 15) == 0) {
                puts("[httpd_handler] Starting pwm\n");
                char* body = malloc(content_length + 1);
                char* body_start = strstr(buf, "\r\n\r\n");
                body_start += 4;
                char* body_end = buf + buflen;
                int total_length = body_end - body_start;
                printf("Total length: %i\r\n", total_length);
                memcpy(body, body_start, total_length);
                netbuf_delete(inbuf);
                if (netconn_recv(conn, &inbuf) == ERR_OK) {
                    puts("Got additional data\r\n");
                    netbuf_data(inbuf, (void **)&buf, &buflen);
                    printf("Additional data length: %i\r\n", buflen);
                    memcpy(body + total_length, buf, buflen);
                }
                body[content_length] = '\0';
                printf("[httpd_handler] body: %s\r\n", body);
                char* start = strstr(body, "name=\"pin\"\r\n\r\n");
                start += 14;
                int pin = atoi(start);
                printf("[httpd_handler] pwm pin: %d\r\n", pin);
                start = strstr(body, "name=\"duty\"\r\n\r\n");
                start += 15;
                int duty = atoi(start);
                float duty_as_float = (float)duty;
                // char* end;
                // float duty = strtof(start, &end);
                // if(end == start) {
                //     puts("Can't convert to float\r\n");
                // } else {
                    printf("[httpd_handler] pwm duty: %d\r\n", duty);
                    printf("[httpd_handler] pwm duty as float: %f\r\n", duty_as_float);
                    printf("[httpd_handler] pwm pin id: %d\r\n", pin);
                    // printf("[httpd_handler] prev pvm start success: %s\r\n", bl_pwm_start(id) == 0 ? "true" : "false");
                    // bl_pwm_stop(id);
                    int id = pwm_to_pin[pin][0];
                    bl_pwm_set_duty(id, duty);
                // }
                netbuf_delete(inbuf);
            }  
            else if (strncmp(buf, "POST /pwm_edit_duty", 19) == 0) {
                // puts("[httpd_handler] Edit duty\n");
                // char* body = malloc(content_length + 1);
                // char* body_start = strstr(buf, "\r\n\r\n");
                // body_start += 4;
                // char* body_end = buf + buflen;
                // int total_length = body_end - body_start;
                // printf("Total length: %i\r\n", total_length);
                // memcpy(body, body_start, total_length);
                // netbuf_delete(inbuf);
                // if (netconn_recv(conn, &inbuf) == ERR_OK) {
                //     puts("Got additional data\r\n");
                //     netbuf_data(inbuf, (void **)&buf, &buflen);
                //     printf("Additional data length: %i\r\n", buflen);
                //     memcpy(body + total_length, buf, buflen);
                // }
                // body[content_length] = '\0';
                // printf("[httpd_handler] body: %s\r\n", body);
                // char* end = strstr(start, "\r\n------");
                // bl_pwm_stop(id);
                // bl_pwm_init(id, pin, 60000);
                // bl_pwm_set_duty(id, value);
                // bl_pwm_start(id);
                // netbuf_delete(inbuf);
            }  
            else if (strncmp(buf, "POST /pwm_stop", 14) == 0) {
                puts("[httpd_handler] Stopping pwm\n");
                // bl_pwm_stop(id);
                netbuf_delete(inbuf);
            } 
            // else if (strncmp(buf, "POST /test", 10) == 0) {
            //     puts("[httpd_handler] Pwm spam...\n");
            //     uint8_t pin = 3;
            //     uint8_t id = 0;
            //     bl_pwm_init(id, pin, 60000);
            //     bl_pwm_set_duty(id, 25);
            //     bl_pwm_start(id);
            //     pin = 4;
            //     id = 1;
            //     bl_pwm_init(id, pin, 60000);
            //     bl_pwm_set_duty(id, 25);
            //     bl_pwm_start(id);
            //     pin = 21;
            //     id = 2;
            //     bl_pwm_init(id, pin, 60000);
            //     bl_pwm_set_duty(id, 25);
            //     bl_pwm_start(id);
            //     netbuf_delete(inbuf);
            // } 
            else netbuf_delete(inbuf);
        } else {
            // Default response (serves an HTML page)
            const char *response =
                "HTTP/1.1 200 OK\r\n"
                "Content-Type: text/html\r\n"
                "Connection: close\r\n\r\n";
            netconn_write(conn, response, strlen(response), NETCONN_COPY);
            netconn_write(conn, html_page, strlen(html_page), NETCONN_COPY);
            netbuf_delete(inbuf);
        }
    }

