vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
    return 0;
}

// static void __opt_feature_init(void)
// {
// #ifdef CONF_USER_ENABLE_VFS_ROMFS
//     romfs_register();
// #endif
// }

static void aos_loop_proc(void *pvParameters)
{
    int fd_console;
    uint32_t fdt = 0, offset = 0;
    static StackType_t proc_stack_looprt[512];
    static StaticTask_t proc_task_looprt;

    /*Init bloop stuff*/
    looprt_start(proc_stack_looprt, 512, &proc_task_looprt);
    loopset_led_hook_on_looprt();

    easyflash_init();
    vfs_init();
    vfs_device_init();

    /* uart */
#if 1
    if (0 == get_dts_addr("uart", &fdt, &offset)) {
        vfs_uart_init(fdt, offset);
    }
#else
    vfs_uart_init_simple_mode(0, 7, 16, 2 * 1000 * 1000, "/dev/ttyS0");
#endif
    if (0 == get_dts_addr("gpio", &fdt, &offset)) {
        hal_gpio_init_from_dts(fdt, offset);
    }

    // __opt_feature_init();
    aos_loop_init();

    fd_console = aos_open("/dev/ttyS0", 0);
    if (fd_console >= 0) {
        printf("Init CLI with event Driven\r\n");
        aos_cli_init(0);
        aos_poll_read_fd(fd_console, aos_cli_event_cb_read_get(), (void*)0x12345678);
        _cli_init();
    }

    aos_register_event_filter(EV_WIFI, event_cb_wifi_event, NULL);
    cmd_stack_wifi(NULL, 0, 0, NULL);
    finished_init = true;

    for(int i = 0; i < 4; i++) {
        int id = pwm_to_pin[i][0];
        int pin = pwm_to_pin[i][1];
        bl_pwm_init(id, pin, 60000);
        bl_pwm_start(id);
        bl_pwm_set_duty(id, 0);
    }

    aos_loop_run();

    puts("------------------------------------------\r\n");
    puts("+++++++++Critical Exit From Loop++++++++++\r\n");
    puts("******************************************\r\n");
    vTaskDelete(NULL);
}

void vApplicationGetIdleTaskMemory(StaticTask_t **ppxIdleTaskTCBBuffer, StackType_t **ppxIdleTaskStackBuffer, uint32_t *pulIdleTaskStackSize)
{
    /* If the buffers to be provided to the Idle task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xIdleTaskTCB;
    static StackType_t uxIdleTaskStack[ configMINIMAL_STACK_SIZE ];

    /* Pass out a pointer to the StaticTask_t structure in which the Idle task's
    state will be stored. */
    *ppxIdleTaskTCBBuffer = &xIdleTaskTCB;

    /* Pass out the array that will be used as the Idle task's stack. */
    *ppxIdleTaskStackBuffer = uxIdleTaskStack;

    /* Pass out the size of the array pointed to by *ppxIdleTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configMINIMAL_STACK_SIZE is specified in words, not bytes. */
    *pulIdleTaskStackSize = configMINIMAL_STACK_SIZE;
}

/* configSUPPORT_STATIC_ALLOCATION and configUSE_TIMERS are both set to 1, so the
application must provide an implementation of vApplicationGetTimerTaskMemory()
to provide the memory that is used by the Timer service task. */
void vApplicationGetTimerTaskMemory(StaticTask_t **ppxTimerTaskTCBBuffer, StackType_t **ppxTimerTaskStackBuffer, uint32_t *pulTimerTaskStackSize)
{
    /* If the buffers to be provided to the Timer task are declared inside this
    function then they must be declared static - otherwise they will be allocated on
    the stack and so not exists after this function exits. */
    static StaticTask_t xTimerTaskTCB;
    static StackType_t uxTimerTaskStack[ configTIMER_TASK_STACK_DEPTH ];

    /* Pass out a pointer to the StaticTask_t structure in which the Timer
    task's state will be stored. */
    *ppxTimerTaskTCBBuffer = &xTimerTaskTCB;

    /* Pass out the array that will be used as the Timer task's stack. */
    *ppxTimerTaskStackBuffer = uxTimerTaskStack;

    /* Pass out the size of the array pointed to by *ppxTimerTaskStackBuffer.
    Note that, as the array is necessarily of type StackType_t,
    configTIMER_TASK_STACK_DEPTH is specified in words, not bytes. */
    *pulTimerTaskStackSize = configTIMER_TASK_STACK_DEPTH;
}

void vAssertCalled(void)
{
    volatile uint32_t ulSetTo1ToExitFunction = 0;

    taskDISABLE_INTERRUPTS();
    while( ulSetTo1ToExitFunction != 1 ) {
        __asm volatile( "NOP" );
    }
}

// static void _dump_boot_info(void)
// {
//     char chip_feature[40];
//     const char *banner;

//     puts("Booting BL602 Chip...\r\n");

//     /*Display Banner*/
//     if (0 == bl_chip_banner(&banner)) {
//         puts(banner);
//     }
//     puts("\r\n");
//     /*Chip Feature list*/
//     puts("\r\n");
//     puts("------------------------------------------------------------\r\n");
//     puts("RISC-V Core Feature:");
//     bl_chip_info(chip_feature);
//     puts(chip_feature);
//     puts("\r\n");

//     puts("Build Version: ");
//     puts(BL_SDK_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("PHY   Version: ");
//     puts(BL_SDK_PHY_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("RF    Version: ");
//     puts(BL_SDK_RF_VER); // @suppress("Symbol is not resolved")
//     puts("\r\n");

//     puts("Build Date: ");
//     puts(__DATE__);
//     puts("\r\n");

//     puts("Build Time: ");
//     puts(__TIME__);
//     puts("\r\n");
//     puts("------------------------------------------------------------\r\n");

// }

static void system_init(void)
{
    blog_init();
    bl_irq_init();
    bl_sec_init();
    bl_sec_test();
    bl_dma_init();
    hal_boot2_init();

    /* board config is set after system is init*/
    hal_board_cfg(0);
}

static void system_thread_init()
{
    /*nothing here*/
}

int timeout = 1000;

static char* get_saved_ssid() {
    // size_t content_len = 0;
    struct env_node_obj info_obj;
    if (!ef_get_env_obj(WIFI_SSID_KEY, &info_obj)) return NULL;
    printf("SSID length: %d\n", info_obj.value_len);
    if(info_obj.value_len <= 0) return NULL;
    char* ssid = malloc(info_obj.value_len);
    ef_get_env_blob(WIFI_SSID_KEY, ssid, info_obj.value_len, NULL);
    return ssid;
}

static char* get_saved_pass() {
    // size_t content_len = 0;
    struct env_node_obj info_obj;
    if (!ef_get_env_obj(WIFI_PASS_KEY, &info_obj)) return NULL;
    if(info_obj.value_len <= 0) return NULL;
    char* pass = malloc(info_obj.value_len);
    ef_get_env_blob(WIFI_PASS_KEY, pass, info_obj.value_len, NULL);
    return pass;
}

static bool connect_to_wifi(char* ssid, char* pass) {
    // int ret;
    // if ((ret = aos_post_event(EV_WIFI, CODE_WIFI_ON_PROV_SSID, (unsigned long) ssid)) < 0) {
    //     printf("[APP] [PROV] trigger SSID event failed, ret %d\r\n", ret);
    //     return false;
    // } 
    // if ((ret = aos_post_event(EV_WIFI, CODE_WIFI_ON_PROV_PASSWD, (unsigned long) pass)) < 0) {
    //     printf("[APP] [PROV] trigger PASSWD event failed, ret %d\r\n", ret);
    //     return false;
    // }
    // return aos_post_event(EV_WIFI, CODE_WIFI_ON_PROV_CONNECT, 0) >= 0;
    wifi_sta_connect(ssid, pass);
    return true;
}

