vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
static void custom_task_func(void *pvParameters) {
    vTaskDelay(1000);
    while (1) {
        if(finished_init) {
            ef_print_env();
            char* ssid = get_saved_ssid();
            char* pass = get_saved_pass();
            printf("SSID: %s\r\n", ssid);
            printf("PASS: %s\r\n", pass);
            if (ssid != NULL && pass != NULL) {
                puts("Connecting to wifi...");
                connect_to_wifi(ssid, pass);
            }
            else {
                if(ssid != NULL) free(ssid);
                if(pass != NULL) free(pass);
                puts("Starting ap...");
                wifi_mgmr_ap_start(wifi_mgmr_ap_enable(), "Test this", 0, NULL, 1);
            }
            break;
        }
        vTaskDelay(3000);
    }
    puts("Custom task end");
    vTaskDelete(NULL);

}

void bfl_main()
{
    static StackType_t aos_loop_proc_stack[1024];
    static StaticTask_t aos_loop_proc_task;
    static StackType_t proc_hellow_stack[512];
    static StaticTask_t proc_hellow_task;
    static StackType_t custom_task_stack[512];
    static StaticTask_t custom_task;
    
    time_main = bl_timer_now_us();
    /*Init UART In the first place*/
    bl_uart_init(0, 16, 7, 255, 255, 2 * 1000 * 1000);
    puts("Starting firmware now....\r\n");

    // _dump_boot_info();

    vPortDefineHeapRegions(xHeapRegions);
    printf("Heap %u@%p, %u@%p\r\n",
            (unsigned int)&_heap_size, &_heap_start,
            (unsigned int)&_heap_wifi_size, &_heap_wifi_start
    );
    printf("Boot2 consumed %lums\r\n", time_main / 1000);

    system_init();
    system_thread_init();

    // puts("[OS] Added proc_hellow_entry task\r\n");
    // xTaskCreateStatic(proc_hellow_entry, (char*)"hellow", 512, NULL, 15, proc_hellow_stack, &proc_hellow_task);
    xTaskCreateStatic(aos_loop_proc, (char*)"event_loop", 1024, NULL, 15, aos_loop_proc_stack, &aos_loop_proc_task);
    puts("[OS] Added aos_loop_proc task\r\n");
    xTaskCreateStatic(custom_task_func, (char*)"custom_task", 512, NULL, 15, custom_task_stack, &custom_task);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    tcpip_init(NULL, NULL);

    puts("[OS] Starting OS Scheduler...\r\n");
    vTaskStartScheduler();
}